Revit 2020 API
ImageTypeOptions Constructor (ExternalResourceReference)
 Constructs a new instance of the ImageTypeOptions object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2020
Syntax
C#
public ImageTypeOptions(
	ExternalResourceReference resourceReference
)
Visual Basic
Public Sub New ( _
	resourceReference As ExternalResourceReference _
)
Visual C++
public:
ImageTypeOptions(
	ExternalResourceReference^ resourceReference
)
Parameters
resourceReference
Type: Autodesk.Revit.DB.ExternalResourceReference
 An external resource reference to an image.
Remarks
ImageTypeOptions uses an external resource reference to determine the local path that will be used to open the image file. The operation to obtain the local path requires the resource to be loaded and is performed at a later time when the local path is needed, for example, for validation. See also LoadResource method of IExternalResourceServer.
When the provided external resource reference contains a local file path, the information can include an indication that the path should be treated as a relative path.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ImageTypeOptions Class
ImageTypeOptions Overload
Autodesk.Revit.DB Namespace